app/controllers/players_controller.rb

SELECT * FROM "players" WHERE (name = 'A. Allen')
SELECT * FROM "players" GROUP BY name
---
  def top
    @points = []
    @players = Player.find(:all, :group => "name")
    @players.each do |player|